OPENFOAM/3d/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}


dimensions      [0 1 -1 0 0 0 0]; 
internalField   uniform (0 0 0); 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.366 0 0); 
    }
    outlet         
    {
    	type            pressureInletOutletVelocity; 
    	value           uniform (0 0 0);   
    }
    wall     
    {
        type            noSlip; 
    }
    front   
    {
        type            symmetryPlane; 
    }

    back
    {
        type            symmetryPlane;
    }
}


