OPENFOAM/3d/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}


transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 15.3e-6; 

