OPENFOAM/3d/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}


simulationType  LES;
LES
{
    LESModel        WALE; 
    turbulence      on;
    printCoeffs     on;


    
    delta	    cubeRootVol;
    cubeRootVolCoeffs
    {
	    deltaCoeff	1;
    }
    
    
    WALECoeffs
    {
        Cw          0.325;
    }

}



