OPENFOAM/3d/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}


scale 1;

vertices
(
    (0.0  0.0   0.0)   
    (3.0  0.0   0.0)   
    (3.0  0.16  0.0)   
    (0.0  0.16  0.0)   
    (0.0  0.0   1.0)  
    (3.0  0.0   1.0)  
    (3.0  0.16  1.0)  
    (0.0  0.16  1.0)  

    (0.0  0.944 0.0)   
    (3.0  0.944 0.0)   
    (0.0  0.944 1.0)  
    (3.0  0.944 1.0)  

    (0.0  1.0   0.0)   
    (3.0  1.0   0.0)   
    (0.0  1.0   1.0)  
    (3.0  1.0   1.0)  
);

blocks
(

    hex (0 1 2 3 4 5 6 7) (300 16 100) simpleGrading (1 1 1)

    hex (3 2 9 8 7 6 11 10) (300 78 100) simpleGrading (1 1 1)

    hex (8 9 13 12 10 11 15 14) (300 6 100) simpleGrading (1 1 1)
);

edges
(
);


boundary
(

    inlet
    {
        type patch;
        faces
        (
            (8 10 14 12)  

        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)    
        );
    }

    wall
    {
        type wall;
        faces
        (

            (0 4 7 3)    
            (3 7 10 8)   

            (0 1 5 4)    
		
	        (12 13 15 14) 

            (2 6 11 9) 
            (9 11 15 13) 
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
            
            (0 1 2 3)		
            (3 2 9 8)		
            (8 9 13 12)		
            
        );
    }

    back
    {
	type symmetryPlane;
	faces
	(
	    (4 5 6 7)		
	    (7 6 11 10)	
        (10 11 15 14)	
	);
     }
);

mergePatchPairs
(
);


